posts/reading/thoughtful-machine-learning/index.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="en">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Thoughtful machine learning | Warren Liu</title>
<link href="../../../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta name="theme-color" content="#5670d4">
<meta name="generator" content="Nikola (getnikola.com)">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../../../rss.xml">
<link rel="canonical" href="https://example.com/posts/reading/thoughtful-machine-learning/">
<!--[if lt IE 9]><![endif]--><meta name="author" content="Warren Liu">
<link rel="prev" href="../../notes/agile-notes/" title="Agile Note" type="text/html">
<link rel="next" href="../spring-integration-in-action/" title="Spring Integration in Action" type="text/html">
<meta property="og:site_name" content="Warren Liu">
<meta property="og:title" content="Thoughtful machine learning">
<meta property="og:url" content="https://example.com/posts/reading/thoughtful-machine-learning/">
<meta property="og:description" content="Table of Contents


K-Nearest Neighbours Classification
Naive Bayesian Classification



Spam Filter using naive bayesian classification




Nerual Networks
Hidden Markov Models






K-Nearest Neighb">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2017-07-15T00:00:00+01:00">
<meta property="article:tag" content="algorithm">
<meta property="article:tag" content="machine learning">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">Skip to main content</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://example.com/">

                <span id="blog-title">Warren Liu</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../../../archive.html">Archive</a>
                </li>
<li>
<a href="../../../categories/">Tags</a>
                </li>
<li>
<a href="../../../rss.xml">RSS feed</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right">
<li>
    <a href="index.org" id="sourcelink">Source</a>
    </li>

                
            </ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="." class="u-url">Thoughtful machine learning</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn" itemprop="author">
                    Warren Liu
            </span></p>
            <p class="dateline"><a href="." rel="bookmark"><time class="published dt-published" datetime="2017-07-15T00:00:00+01:00" itemprop="datePublished" title="2017-07-15 00:00">2017-07-15 00:00</time></a></p>
            
        <p class="sourceline"><a href="index.org" class="sourcelink">Source</a></p>

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">K-Nearest Neighbours Classification</a></li>
<li>
<a href="#sec-2">Naive Bayesian Classification</a>
<ul>
<li>
<ul>
<li><a href="#sec-2-0-1">Spam Filter using naive bayesian classification</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-3">Nerual Networks</a></li>
<li><a href="#sec-4">Hidden Markov Models</a></li>
</ul>
</div>
</div>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">K-Nearest Neighbours Classification</h2>
<div class="outline-text-2" id="text-1">
<p>
K-Nearest Neighbour is one of the best algorithms for classifying data
sets. It is lazy and nonparametric.
</p>

<ul class="org-ul">
<li>A <b>perceptual hash (pHash)</b> is a fingerprint of a multimedia file
derived from various features from its content. Unlike cryptographic
hash functions, where small changes in input leading to drastic
changes in the putput, <span class="underline">perceptual hashes are "close" to another if
the features are similar</span>.
</li>
<li>Hamming distance: between two strings of equal length is the number
of positions at which the corresponding symbols are different. It
measures the minimum number of substitutions required to change one
string into the other.
</li>
<li>How to pick K:
<ul class="org-ul">
<li>It is usually domain specific;
</li>
<li>Choose a K that is low enough to avoid noise;
</li>
<li>Iterate through a couple of possbile Ks unitl finding a suitable
error with <b>cross validation</b>, given the training set.
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Naive Bayesian Classification</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>
<b>Conditional Probablities</b> is a measure of the probablitity of an
event given that another event has occured:
<p>
\begin{equation} P(A|B) = \frac{P(A \cap B)}{P(B)} \end{equation}
Note that this is a <b>definition but not a theoretical result</b>. We just
denote the quantity \(P(A\cap B)/P(B)\) as \(P(A|B)\)
and call it the conditional probability of A given B.
</p>
</li>
<li>In statistical inference, <b>Conditional Probablities</b> is an update of
the probablitity of an event based on new information.
</li>
<li>Inverse conditional probablity (aka Bayes's Theorem):
<p>
\begin{equation} P(A\mid B) = \frac{P(B \mid A) \, P(A)}{P(B)}
\end{equation}
</p>
</li>
<li>Naive Bayesian classifier assume the independence assumptions
between the features.
</li>
</ul>
</div>

<div id="outline-container-sec-2-0-1" class="outline-4">
<h4 id="sec-2-0-1">Spam Filter using naive bayesian classification</h4>
<div class="outline-text-4" id="text-2-0-1">
<ul class="org-ul">
<li>A tokenizer to extract words into a stream, instead of an array, to
keep a low memory usage.
</li>
<li>For all word in each training email, the filter will adjust the
probabilities each word will appear in spam or ham.
</li>
<li>The word probablities (also known as likelihood functions) are used
to compute the probablitity that an email with a particular set of
words in it belongs to either category.
</li>
<li>With the native bayesian classification, the score for spam based on
word can be simplified as:
\begin{equation}
  Score(spam, W_1, W_2, ..., W_n) = P(spam)P(W_1|spam)P(W_2|spam)...P(W_n|spam)
\end{equation}
<p>
which is then divided some normalizing constant Z.
</p>
</li>
<li>Cross-validation to minimizing false positives (instead of error)
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Nerual Networks</h2>
</div>


<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Hidden Markov Models</h2>
<div class="outline-text-2" id="text-4">
<p>
Hidden Markov Models can be either supervised or unsupervised, and
also are called Markovian due to theire reliance on a Markov
Model. They work well where there doesn't need to be a lot of
historical information built into the model.
</p>
</div>
</div>
    </div>
    <aside class="postpromonav"><nav><ul itemprop="keywords" class="tags">
<li><a class="tag p-category" href="../../../categories/algorithm/" rel="tag">algorithm</a></li>
            <li><a class="tag p-category" href="../../../categories/machine-learning/" rel="tag">machine learning</a></li>
        </ul>
<ul class="pager hidden-print">
<li class="previous">
                <a href="../../notes/agile-notes/" rel="prev" title="Agile Note">Previous post</a>
            </li>
            <li class="next">
                <a href="../spring-integration-in-action/" rel="next" title="Spring Integration in Action">Next post</a>
            </li>
        </ul></nav></aside></article>
</div>
        <!--End of body content-->

        <footer id="footer">
            Contents © 2017         <a href="mailto:n.tesla@example.com">Warren Liu</a> - Powered by         <a href="https://getnikola.com" rel="nofollow">Nikola</a>         
            
        </footer>
</div>
</div>


            <script src="../../../assets/js/all-nocdn.js"></script><script>$('a.image-reference:not(.islink) img:not(.islink)').parent().colorbox({rel:"gal",maxWidth:"100%",maxHeight:"100%",scalePhotos:true});</script><!-- fancy dates --><script>
    moment.locale("en");
    fancydates(0, "YYYY-MM-DD HH:mm");
    </script><!-- end fancy dates -->
</body>
</html>
